{
    "Physical" : {
        "Pranayama" : [
            {
                "name": "Kapalbhati Pranayama",
                "english name": "Skull Shining Breath",
                "info": "Known as the \"Skull-Shining Breath,\" it is believed to stimulate the pancreas and improve insulin sensitivity.",
                "process": "Sit in a comfortable position with your spine straight and hands on your knees. Take a deep breath in and exhale forcefully through your nostrils by contracting your abdominal muscles. Inhale passively and continue forceful exhalations for about 20-30 seconds. Gradually increase the duration as you build strength. Practice 2-3 rounds with a short break in between.",
                "images": "https://i.imgur.com/SO3MIhW.jpg",
                "links": ""
            },
            {
                "name": "Anulom Vilom Pranayama",
                "english name": "Alternate Nostril Breathing",
                "info": "Helps balance the autonomic nervous system and reduce stress, which can benefit blood sugar management.",
                "process": "Sit comfortably with your spine straight. Close your right nostril with your right thumb and inhale deeply through the left nostril. Close the left nostril with your ring finger, release the right nostril, and exhale through the right nostril. Inhale through the right nostril, close it, and exhale through the left nostril. This completes one cycle. Repeat for 5-10 cycles.",
                "images": "https://i.imgur.com/OeIXjhw.jpg",
                "links": ""
            },
            {
                "name": "Bhastrika Pranayama",
                "english name": "Bellows Breath",
                "info": "Increases metabolic rate and may assist in better glucose metabolism.",
                "process": "Sit comfortably with your spine straight. Inhale deeply through both nostrils and exhale forcefully. It's like a rapid pumping motion with equal emphasis on inhalation and exhalation. Start with 20-30 seconds and gradually increase the duration.",
                "images": "",
                "links": ""
            },
            {
                "name": "Ujjayi Pranayama",
                "english name": "Victorious Breath or Ocean Breath",
                "info": "Calms the mind, reduces stress, and may help regulate blood sugar levels.",
                "process": "Sit in a comfortable position and close your eyes. Inhale deeply through your nose while slightly constricting the back of your throat. Exhale slowly through your nose using the same throat constriction. Focus on the sound of your breath. Practice for 5-10 minutes.",
                "images": "",
                "links": ""
            },
            {
                "name": "Surya Bhedana",
                "english name": "Right Nostril Breathing",
                "info": "Activates right nostril, boosts energy, calms the mind, and enhances lung capacity.",
                "process": "Find a comfortable seated position, such as Sukhasana (Easy Pose) or Padmasana (Lotus Pose). Close your eyes and relax your body. Use your right thumb to close the right nostril and take a deep breath in through the left nostril. Close the left nostril with your right ring finger, release the right nostril, and exhale slowly and completely through the right nostril. Inhale through the right nostril. Close the right nostril with your right thumb, release the left nostril, and exhale through the left nostril. This completes one cycle. Continue for 5-10 minutes, gradually increasing the duration with practice.",
                "images": "",
                "links": ""
            },
            {
                "name": "Bhramari",
                "english name": "Humming Bee Breath",
                "info": "Reduces stress, improves focus, balances emotions, and promotes emotional well-being through soothing humming breath.",
                "process": "Sit comfortably in a meditative posture with your eyes closed. Place your thumbs gently in your ears, your index fingers on your forehead, your middle fingers on your closed eyes, your ring fingers on your nostrils, and your pinky fingers just above your upper lip. Take a deep breath in through your nose. As you exhale, make a humming sound like a bee (hence the name \"Bhramari\"), allowing the sound to be continuous and soothing. Focus on the sound and vibrations inside your head as you continue to breathe out. Complete 5-10 rounds or more, as per your comfort, to experience the calming effect fully.",
                "images": "",
                "links": ""
            },
            {
                "name": "Sheetali Pranayama",
                "info": "Sheetali pranayama, or cooling breath, helps reduce body heat, soothe the nervous system, and alleviate stress and anxiety.",
                "process": "Sit comfortably and roll your tongue into a tube shape. Inhale through the rolled tongue slowly and deeply. Close your mouth and exhale through your nose. Repeat for several breaths.",
                "images": "",
                "links": ""
            }
        ],
        "Yoga Asanas" : [
            {
                "name": "Paschimottanasana",
                "english name": "Seated Forward Bend",
                "info": "Stimulates the abdominal organs, including the pancreas, and can help improve digestion.",
                "process": "Sit with your legs extended in front. Inhale and lengthen your spine. Exhale and bend forward from your hips, reaching for your toes or shins. Hold for 30 seconds to 1 minute.",
                "images": "https://i.imgur.com/mHXfXm1.jpg",
                "links": ""
            },
            {
                "name": "Dhanurasana",
                "english name": "Bow Pose",
                "info": "Aids in stimulating the pancreas and improving insulin secretion.",
                "process": "Lie on your stomach, bend your knees, and reach back to hold your ankles. Inhale and lift your chest and thighs off the ground. Hold for 15-30 seconds.",
                "images": "https://i.imgur.com/zG0YGr8.jpg",
                "links": ""
            },
            {
                "name": "Ardha Matsyendrasana",
                "english name": "Half Spinal Twist",
                "info": "Helps massage the abdominal organs and can improve digestion.",
                "process": "Sit with your legs extended, bend one knee, and place the foot outside the opposite thigh. Twist your torso to face the bent knee. Hold for 30 seconds on each side.",
                "images": "",
                "links": ""
            },
            {
                "name": "Vrikshasana",
                "english name": "Tree Pose",
                "info": "Enhances balance and concentration, which can be helpful for overall wellness.",
                "process": "Stand tall and shift your weight to one foot. Lift the other foot and place it on the inner thigh of the standing leg. Balance and hold for 30 seconds on each leg.",
                "images": "https://i.imgur.com/yvvFsE1.jpg",
                "links": ""
            },
            {
                "name": "Trikonasana",
                "english name": "Triangle Pose",
                "info": "Strengthens the legs and stretches the sides of the body, promoting overall fitness.",
                "process": "Stand with your legs wide apart. Reach one arm down to your shin or the floor and extend the other arm up. Hold for 30 seconds on each side.",
                "images": "https://i.imgur.com/nCsC7gj.jpg",
                "links": ""
            },
            {
                "name": "Shalabhasana",
                "english name": "Locust Pose",
                "info": "Strengthens the lower back and can help improve circulation to the pancreas.",
                "process": "Lie on your stomach with your arms alongside your body and forehead on the ground. Keep your legs straight and together. Inhale and lift your head, chest, arms, and legs off the ground simultaneously. Keep your gaze down and neck aligned with your spine. Hold the pose for a few breaths, then exhale as you lower your body back to the ground. Repeat 3-5 times, gradually increasing the duration.",
                "images": "https://i.imgur.com/Jt2Zrqw.jpg",
                "links": ""
            },
            {
                "name": "Setu Bandhasana",
                "english name": "Bridge Pose",
                "info": "Activates the abdominal organs and can assist in better digestion.",
                "process": "Lie on your back with your knees bent and feet flat on the floor, hip-width apart. Place your arms alongside your body with palms facing down. Inhale and lift your hips and lower back off the ground, pressing through your feet. Roll your shoulders under and interlace your fingers beneath your back for support. Keep your thighs parallel and your neck relaxed. Hold the pose for several breaths, then exhale as you gently lower your spine back to the floor. Repeat as desired.",
                "images": "https://i.imgur.com/RY4HjPO.jpg",
                "links": ""
            },
            {
                "name": "Ardha Halasana",
                "english name": "Half Plough Pose",
                "info": "Promotes blood circulation to the abdominal region and may support pancreatic health.",
                "process": "Lie on your back with your legs straight and arms alongside your body. Place your hands under your hips, palms facing down. Inhale and lift your legs off the ground, keeping them together. Raise your legs until they are perpendicular to the ground or at a comfortable angle. Keep your neck and shoulders relaxed. Hold the pose for a few breaths, then exhale as you lower your legs back to the ground. Repeat 3-5 times, gradually increasing the duration.",
                "images": "",
                "links": ""
            },
            {
                "name": "Bhujangasana",
                "english name": "Cobra Pose",
                "info": "Strengthens the spine and can improve digestion.",
                "process": "Lie on your stomach with your legs straight and tops of your feet on the ground. Place your hands under your shoulders, palms facing down. Inhale and gently lift your chest off the ground, using your back muscles. Keep your elbows slightly bent and shoulders away from your ears. Look forward or slightly upward, keeping your neck in line with your spine. Hold the pose for a few breaths, then exhale as you lower your chest back to the ground. Repeat as desired.",
                "images": "https://i.imgur.com/WHga51L.jpg",
                "links": ""
            },
            {
                "name": "Matsyasana",
                "english name": "Fish Pose",
                "info": "Stretches the neck and throat, stimulating the thyroid and parathyroid glands.",
                "process": "Sit in Padmasana (Lotus Pose) or Sukhasana (Easy Pose). Place your hands under your hips with palms facing down. Inhale and arch your back, lifting your chest upward. Tilt your head back and allow the crown of your head to rest on the floor. Keep your legs crossed or extended, and your elbows tucked in. Hold the pose for a few breaths, then exhale as you release and sit up.",
                "images": "https://i.imgur.com/9wd2yk3.jpg",
                "links": ""
            },
            {
                "name": "Surya Namaskar",
                "english name": "Sun Salutations",
                "info": "A series of yoga postures that help improve overall metabolism and fitness.",
                "process": "Step 1: Pranamasana (Prayer Pose). Stand at the front of your mat with your feet together and hands in a prayer position at your chest. Take a few deep breaths, center yourself, and set an intention for your practice. Step 2: Hasta Uttanasana (Raised Arms Pose) Inhale as you lift your arms overhead, arching your back slightly and reaching up. Keep your biceps close to your ears and look up. Step 3: Uttanasana (Forward Bend) Exhale as you hinge at your hips and fold forward from your waist. Keep your spine long and bring your hands down to touch the ground on either side of your feet. Step 4: Ashwa Sanchalanasana (Equestrian Pose) Inhale and step your right leg back into a lunge, keeping your left knee bent at a 90-degree angle. Look up and keep your hands on the ground or on your left knee. Step 5: Dandasana (Plank Pose) Exhale as you step your left leg back, coming into a plank position. Keep your body in a straight line from head to heels. Step 6: Ashtanga Namaskara (Eight-Limbed Pose) Lower your knees, chest, and chin to the ground while exhaling. Keep your hips lifted. Eight points of your body touch the floor: two hands, two feet, two knees, chest, and chin Step 7: Bhujangasana (Cobra Pose) Inhale and slide forward, lifting your chest off the ground. Keep your elbows bent and close to your body. Press the tops of your feet and thighs into the mat and look up. Step 8: Parvatasana (Downward-Facing Dog Pose) Exhale as you lift your hips and tailbone, coming into an inverted \"\"V\"\" shape. Press your heels toward the floor, keep your spine long, and gaze toward your navel. Step 9: Ashwa Sanchalanasana (Equestrian Pose, other side) Inhale as you step your right foot forward between your hands, left knee on the ground. Look up and keep your hands on the ground or on your right knee. Step 10: Uttanasana (Forward Bend) Exhale as you step your left foot forward to meet the right foot in a forward bend. Keep your spine long, head down, and hands on the ground. Step 11: Hasta Uttanasana (Raised Arms Pose) Inhale as you rise up, lifting your arms overhead, arching your back slightly, and reaching up. Keep your biceps close to your ears and look up. Step 12: Pranamasana (Prayer Pose) Exhale and return to the prayer pose at your chest. Take a moment to breathe and complete one round of Surya Namaskar.",
                "images": "",
                "links": ""
            },
            {
                "name": "Eka and dwipadothanadana",
                "english name": "",
                "info": "Enhances flexibility in the spine, stretches the hamstrings, and improves posture.",
                "process": "Sit with your legs extended. Inhale and lift one or both legs while reaching forward to touch your toes. Keep your spine straight and exhale as you bend forward.",
                "images": "",
                "links": ""
            },
            {
                "name": "Janu shirashasan",
                "english name": "",
                "info": "Stretches the spine and hamstrings, improves digestion, and calms the mind.",
                "process": "Sit with one leg extended and the sole of the other foot against the inner thigh.  Inhale and lengthen your spine, then exhale as you bend forward to touch your extended leg.",
                "images": "https://i.imgur.com/gIjAb9O.jpg",
                "links": ""
            },
            {
                "name": "Sarvangasana",
                "english name": "",
                "info": "Boosts blood circulation to the brain, strengthens the shoulders and neck, and improves thyroid function.",
                "process": "Lie on your back, lift your legs, hips, and torso to create a straight line with your body, supporting your lower back with your hands.",
                "images": "https://i.imgur.com/B5U9xt9.jpg",
                "links": ""
            },
            {
                "name": "Halasana",
                "english name": "",
                "info": "Stretches the spine, shoulders, and hamstrings, improves digestion, and relaxes the nervous system.",
                "process": "From Sarvangasana, lower your legs behind your head to touch the ground, keeping your feet together and your hands on your back for support.",
                "images": "",
                "links": ""
            },
            {
                "name": "Vajrasana",
                "english name": "",
                "info": "Promotes digestion, reduces acidity, and strengthens the lower back and pelvic muscles.",
                "process": "Kneel down with your big toes touching and sit on your heels. Keep your back straight and hands on your thighs.",
                "images": "https://i.imgur.com/ofF6Hyy.jpg",
                "links": ""
            },
            {
                "name": "Bharadwajasana",
                "english name": "",
                "info": "Increases spinal flexibility, relieves lower back pain, and massages abdominal organs.",
                "process": "Sit with your legs extended. Twist your torso to one side, placing the opposite hand on the outside of the knee and the other hand behind you.",
                "images": "https://i.imgur.com/Dc6Gj0c.jpg",
                "links": ""
            },
            {
                "name": "Balasana",
                "english name": "",
                "info": "Relaxes the back and neck, reduces stress, and promotes a sense of calm.",
                "process": "Kneel down, sit back on your heels, and extend your arms forward, resting your forehead on the ground.",
                "images": "https://i.imgur.com/41sA7UB.jpg",
                "links": ""
            },
            {
                "name": "Pavanamuktasana",
                "english name": "",
                "info": "Aids digestion, relieves gas and bloating, and strengthens the abdominal muscles.",
                "process": "Lie on your back, hug one knee to your chest while extending the other leg, then switch sides.",
                "images": "https://i.imgur.com/2ftdGZc.jpg",
                "links": ""
            },
            {
                "name": "Shavasana",
                "english name": "",
                "info": "Reduces stress, relaxes the entire body, and promotes deep relaxation.",
                "process": "Lie on your back with arms and legs extended, palms facing up. Close your eyes and focus on your breath.",
                "images": "https://i.imgur.com/pgbZaRS.jpg",
                "links": ""
            },
            {
                "name": "Mashamudrasana",
                "english name": "",
                "info": "Enhances spinal flexibility, stimulates digestion, and strengthens the core.",
                "process": "Sit with one leg extended and the other foot placed over the extended leg. Twist your torso toward the bent knee, holding the opposite knee with your hand.",
                "images": "",
                "links": ""
            },
            {
                "name": "Yogamudrasana",
                "english name": "",
                "info": "Improves posture, stretches the spine, and enhances flexibility in the shoulders and back.",
                "process": "Sit with your legs extended, bend forward, and reach your hands behind your back to clasp them together, lifting your arms as high as comfortable.",
                "images": "",
                "links": ""
            }
        ],
        "Mudras for Diabetes Management" : [
            {
                "name": "Prana Mudra",
                "english name": "",
                "info": "Believed to increase vital life force energy and may help balance bodily functions, including those related to diabetes.",
                "process": "Sit in a comfortable meditation posture. Touch the tips of your thumb, ring finger, and little finger together while keeping the other fingers extended. Hold this mudra with both hands and rest your hands on your knees. Breathe naturally and focus on your breath. Practice for 15-20 minutes daily.",
                "images": "",
                "links": ""
            },
            {
                "name": "Apan Vayu Mudra",
                "english name": "",
                "info": "Can help regulate diabetes by balancing the elements within the body and supporting the digestive system.",
                "process": "Sit comfortably and touch the tips of your thumb, middle finger, and ring finger together while extending the other fingers. Hold this mudra with both hands and rest your hands on your knees. Breathe naturally and focus on your breath. Practice for 15-20 minutes daily.",
                "images": "",
                "links": ""
            },
            {
                "name": "Gyan Mudra",
                "english name": "",
                "info": "Promotes better concentration and mental clarity, which can be beneficial for managing diabetes.",
                "process": "",
                "images": "",
                "links": ""
            },
            {
                "name": "Apana Mudra",
                "english name": "",
                "info": "Benefits: Aids in digestion, helps detoxify the body, relieves constipation, and promotes a sense of grounding.",
                "process": "How to: Touch the tips of the thumb, middle finger, and ring finger together, while keeping the index and little fingers extended.",
                "images": "",
                "links": ""
            },
            {
                "name": "Rudra Mudra",
                "english name": "",
                "info": "Benefits: Reduces stress and anxiety, balances the body's energy, and enhances inner strength and confidence.",
                "process": "How to: Bend the index finger to touch the base of the thumb, while keeping the other fingers extended.",
                "images": "",
                "links": ""
            },
            {
                "name": "Hrudaya mudra",
                "english name": "",
                "info": "Benefits: Promotes emotional balance, reduces feelings of anger and anxiety, and enhances heart health.",
                "process": "How to: Bend the index finger to touch the base of the thumb, while keeping the other fingers extended.",
                "images": "",
                "links": ""
            },
            {
                "name": "Linga mudra",
                "english name": "",
                "info": "Benefits: Generates heat in the body, boosts metabolism, and strengthens the immune system.",
                "process": "How to: Interlock the fingers of both hands and clasp them together, keeping the left thumb upright, encircled by the right thumb and index finger.",
                "images": "",
                "links": ""
            },
            {
                "name": "Surya Mudra",
                "english name": "",
                "info": "Benefits: Increases warmth in the body, aids in weight management, and enhances digestion.",
                "process": "How to: Bend the ring finger to touch the base of the thumb, while keeping the other fingers extended.",
                "images": "",
                "links": ""
            },
            {
                "name": "Raga Bilawal",
                "english name": "",
                "info": "Associated with peace and tranquility, it may help reduce stress and promote relaxation.",
                "process": "Listen to music compositions based on Raga Bilawal, such as classical instrumental or vocal performances. Find a quiet and comfortable space to relax. Allow the music to immerse you in its calming melodies. Practice listening to this raga regularly for relaxation.",
                "images": "",
                "links": ""
            },
            {
                "name": "Raga Bhairav",
                "english name": "",
                "info": "Believed to have therapeutic effects on the body and mind, it can assist in stress reduction.",
                "process": "Listen to music compositions based on Raga Bhairav, such as classical instrumental or vocal performances. Find a quiet and comfortable space to relax. Allow the music to immerse you in its calming melodies. Practice listening to this raga regularly for relaxation.",
                "images": "",
                "links": ""
            },
            {
                "name": "Raga Kalyani",
                "english name": "",
                "info": "Known for its soothing qualities, it can help alleviate stress and anxiety, which are often linked to diabetes.",
                "process": "Listen to music compositions based on Raga Kalyani, such as classical instrumental or vocal performances. Find a quiet and comfortable space to relax. Allow the music to immerse you in its calming melodies. Practice listening to this raga regularly for relaxation.",
                "images": "",
                "links": ""
            },
            {
                "name": "Raga Yaman",
                "english name": "",
                "info": "Promotes a sense of well-being and is believed to help reduce mental and emotional disturbances.",
                "process": "Listen to music compositions based on Raga Yaman, such as classical instrumental or vocal performances. Find a quiet and comfortable space to relax. Allow the music to immerse you in its calming melodies. Practice listening to this raga regularly for relaxation.",
                "images": "",
                "links": ""
            },
            {
                "name": "Raga Bhupali",
                "english name": "",
                "info": "May assist in calming the mind and relieving stress, which can be beneficial for overall health.",
                "process": "Listen to music compositions based on Raga Bhupali, such as classical instrumental or vocal performances. Find a quiet and comfortable space to relax. Allow the music to immerse you in its calming melodies. Practice listening to this raga regularly for relaxation.",
                "images": "",
                "links": ""
            },
            {
                "name": "Raga Darbari",
                "english name": "",
                "info": "Known for its meditative and relaxing qualities, it can aid in stress management.",
                "process": "Listen to music compositions based on Raga Darbari, such as classical instrumental or vocal performances. Find a quiet and comfortable space to relax. Allow the music to immerse you in its calming melodies. Practice listening to this raga regularly for relaxation.",
                "images": "",
                "links": ""
            },
            {
                "name": "Raga Madhyamavati",
                "english name": "",
                "info": "May have a soothing effect on the nervous system and help reduce stress-related factors.",
                "process": "Listen to music compositions based on Raga Madhyamavati, such as classical instrumental or vocal performances. Find a quiet and comfortable space to relax. Allow the music to immerse you in its calming melodies. Practice listening to this raga regularly for relaxation.",
                "images": "",
                "links": ""
            },
            {
                "name": "Raga Bhupeshwari",
                "english name": "",
                "info": "Promotes emotional balance and relaxation, which can be beneficial for overall wellness.",
                "process": "Listen to music compositions based on Raga Bhupeshwari, such as classical instrumental or vocal performances. Find a quiet and comfortable space to relax. Allow the music to immerse you in its calming melodies. Practice listening to this raga regularly for relaxation.",
                "images": "",
                "links": ""
            }
        ],
        "Color Therapy" : [
            {
                "name": "Blue Color",
                "english name": "",
                "info": "Blue color in color therapy is associated with calming, promoting relaxation, enhancing communication, aiding mental clarity, and fostering emotional balance.",
                "process": "Surround yourself with blue colors in your environment, such as blue walls, bedding, or clothing. Spend time in nature by the water, like the ocean or a serene lake. Incorporate blue into your meditation space, using blue candles or decorations.",
                "images": "",
                "links": ""
            },
            {
                "name": "Yellow and Green Colors",
                "english name": "",
                "info": "These colors are associated with balance and harmony in Ayurveda.",
                "process": "Surrounding yourself with these colors or visualizing them during meditation may promote wellness.",
                "images": "",
                "links": ""
            }
        ],
        "Seed Therapy" : [
            {
                "name": "Fenugreek Seeds",
                "english name": "",
                "info": "Fenugreek seeds help regulate blood sugar, improve insulin sensitivity, and aid in weight management.",
                "process": "Soak fenugreek seeds in water overnight. Consume the soaked seeds and the water on an empty stomach in the morning. You can also use fenugreek seeds in cooking.",
                "images": "",
                "links": ""
            }
        ],
        "Nutrition & Diet" : [
            {
                "name": "Whole Grains (Brown rice, oats, quinoa)",
                "english name": "",
                "info": "Whole grains provide steady blood sugar control, are high in fiber for digestion, and promote heart health.",
                "process": "Include these grains in your daily diet as the primary source of carbohydrates. Replace refined grains with whole grains in recipes.",
                "images": "",
                "links": ""
            },
            {
                "name": "Fresh Vegetables (especially bitter vegetables)",
                "english name": "",
                "info": "Fresh vegetables are low in calories, contain bitter varieties that lower blood sugar, and offer essential nutrients.",
                "process": "Incorporate bitter vegetables like bitter gourd (karela) and fenugreek leaves (methi) into your meals. Cook them with spices and herbs for flavor.",
                "images": "",
                "links": ""
            },
            {
                "name": "Legumes (lentils, chickpeas)",
                "english name": "",
                "info": "Legumes are high in fiber for blood sugar control, provide plant-based protein, and benefit heart health.",
                "process": "Include legumes in your diet for plant-based protein and fiber. Prepare lentil soups, chickpea curries, or salads.",
                "images": "",
                "links": ""
            },
            {
                "name": "Lean Proteins (chicken, fish, tofu)",
                "english name": "",
                "info": "Lean proteins satisfy hunger, support muscle maintenance, and are part of a balanced diet for blood sugar control.",
                "process": "Opt for lean protein sources and cook them with minimal added fats. Grill, bake, or steam your protein choices.",
                "images": "",
                "links": ""
            },
            {
                "name": "Healthy Fats (avocado, nuts, seeds)",
                "english name": "",
                "info": "Healthy fats improve insulin sensitivity, promote heart health, and increase satiety.",
                "process": "Consume healthy fats like avocados, almonds, walnuts, and chia seeds in moderation. Use them in salads, smoothies, or as snacks.",
                "images": "",
                "links": ""
            },            
            {
                "name": "Fiber-rich Foods (beans, broccoli, whole fruits)",
                "english name": "",
                "info": "Fiber-rich foods regulate blood sugar, enhance digestion, and aid in weight management.",
                "process": "Increase your fiber intake with foods like beans, lentils, broccoli, and whole fruits. Aim to consume at least 25-30 grams of fiber per day.",
                "images": "",
                "links": ""
            }

        ]
    },
    "Financial" : {
        "Health Insurance Review": [
            {
                "name": "",
                "english name": "",
                "info": "Advice to You: Let's start by carefully reviewing your health insurance policy to understand the coverage for diabetes-related expenses. We should look for policies that specifically cover diabetes management.",
                "process": "Websites: HDFC Ergo, ICICI Lombard, PolicyBazaar ",
                "images": "",
                "links": "https://www.policybazaar.com/health-insurance/health-insurance-india/"
            }
        ],
        "Budget for Medical Expenses": [
            {
                "name": "",
                "english name": "",
                "info": "Advice to You: It's important to create a dedicated budget for medical expenses, including doctor's visits, diagnostic tests, and medications.",
                "process": "Websites: To understand the cost of diabetes management in India, you can refer to resources like the National Institute of Nutrition (nin.res.in).",
                "images": "",
                "links": "https://www.irdai.gov.in/ https://www.nin.res.in/"
            }
        ],
        "Medication Costs": [
            {
                "name": "",
                "english name": "",
                "info": "Advice to You: Let's discuss the cost of medications and explore options like generic brands or prescription discount programs to reduce expenses.",
                "process": "Websites: For comparing medication prices and finding discounts, you can use websites like 1mg, Netmeds, or MedPlusMart.",
                "images": "",
                "links": "https://www.1mg.com/ https://www.netmeds.com/ https://www.medplusmart.com/"
            }
        ],
        "Lifestyle Adjustments": [
            {
                "name": "",
                "english name": "",
                "info": "Advice to You: Emphasizing a healthy lifestyle is crucial. We should focus on budget-friendly fitness options like walking, jogging, or using free exercise videos available online.",
                "process": "Websites: You can consider websites like HealthifyMe, which offers affordable online fitness and nutrition plans.",
                "images": "",
                "links": "https://www.healthifyme.com/us/"
            }
        ],
        "Dietary Choices": [
            {
                "name": "",
                "english name": "",
                "info": "Advice to You: Educating yourself about cost-effective, diabetes-friendly foods such as whole grains, lentils, and seasonal vegetables is essential.",
                "process": "Websites: For dietary guidelines on diabetes management, you can visit the Indian Dietetic Association (IDA) website (ida.org.in).",
                "images": "",
                "links": "https://ida.org.in/ https://www.omicsonline.org/societies/indian-dietetic-association/"
            }
        ],
        "Regular Check-Ups": [
            {
                "name": "",
                "english name": "",
                "info": "Advice to You: Regular check-ups and preventive care are vital. We should aim to catch potential issues early.",
                "process": "Websites: To find information on government health programs and check-up facilities, you can check the Ministry of Health and Family Welfare (mohfw.gov.in) website.",
                "images": "",
                "links": "https://www.mohfw.gov.in/"
            }
        ],
        "Financial Planning": [
            {
                "name": "",
                "english name": "",
                "info": "Advice to You: Working with a certified financial planner can help us create a comprehensive financial plan that includes healthcare expenses.",
                "process": "Websites: To find certified financial planners, you can visit the Certified Financial Planner Board of India (cfpbci.in) website.",
                "images": "",
                "links": "https://www.ncfe.org.in/ https://www.cfpbci.in/"
            }
        ],
        "Track Expenses": [
            {
                "name": "",
                "english name": "",
                "info": "Advice to You: It's a good idea to use budgeting apps or spreadsheets to track healthcare expenses.",
                "process": "Websites: For expense tracking, consider using budgeting tools like ET Money or Walnut.",
                "images": "",
                "links": "https://www.etmoney.com https://littlesaves.com/tag/personal-finance/#gs.5a7gwy"
            }
        ],
        "Support Groups and Resources": [
            {
                "name": "",
                "english name": "",
                "info": "Advice to You: Joining local or online diabetes support groups can provide valuable information and emotional support.",
                "process": "Websites: You can participate in online diabetes communities like Diabetes India Forum (diabetesindia.com) for discussions.",
                "images": "",
                "links": "http://diabetesindia.com/"
            }
        ],
        "Emergency Fund": [
            {
                "name": "",
                "english name": "",
                "info": "Advice to You: Ensure you have an emergency fund in place that can cover unexpected medical expenses related to diabetes.",
                "process": "Websites: For guidance on building emergency funds, you can check out financial advice websites like Value Research Online (valueresearchonline.com).",
                "images": "",
                "links": "https://www.valueresearchonline.com/"
            }
        ]
    },
    "All Schemes": {
        "NPCDCS": "This is a centrally sponsored scheme that includes diabetes as one of the major non-communicable diseases (NCDs) targeted for prevention and control. The program aims to provide early diagnosis and management of diabetes through various health facilities.",
        "NHM": "Under NHM, various state governments in India run health and wellness centers (HWCs) that offer comprehensive primary healthcare services. These centers may provide diabetes screening and management services.",
        "PM-JAY": "This is a government health insurance scheme that aims to provide financial protection to vulnerable families for secondary and tertiary care, including diabetes-related treatments and hospitalizations.",
        "RBSK": "This program focuses on child health, including screening and early detection of NCDs like diabetes in children.",
        "MNDY": "Some states, like Delhi, have introduced schemes that provide free medicines for various diseases, including diabetes, to residents.",
        "DDPCU": "Many districts in India have established dedicated units to control and manage diabetes. These units organize awareness campaigns, conduct screenings, and provide counseling and treatment.",
        "SHP": "Some states include diabetes awareness and prevention as part of their school health programs to educate children about healthy lifestyles.",
        "NPCB": "Diabetes can lead to vision problems and blindness. NPCB aims to reduce blindness due to diabetes by providing eye care services and treatment.",
        "IEC": "Information, Education, and Communication (IEC) campaigns are run by the government to create awareness about diabetes prevention and management. These campaigns may include television and radio advertisements, posters, and educational materials."
    },
    "Karnataka Diabetes Government Healthcare Schemes": {
        "NCD Control": "Karnataka, like other states in India, has implemented the National Programme for Prevention and Control of Cancer, Diabetes, Cardiovascular Diseases, and Stroke (NPCDCS) at the state level. This program focuses on preventing and controlling non-communicable diseases, including diabetes.",
        "Mukhyamantri Aarogya Bhagya Scheme": "The Karnataka government launched the Mukhyamantri Aarogya Bhagya Scheme to provide free medical treatment to below-poverty-line (BPL) families. This scheme covers various health conditions, including diabetes.",
        "HWCs": "Under the National Health Mission (NHM), Karnataka has been setting up Health and Wellness Centers (HWCs) that offer comprehensive primary healthcare services. These centers may provide diabetes screening and management services",
        "JSSK": "JSSK is a scheme that provides free and cashless services to pregnant women and sick neonates. It may cover diabetes-related complications during pregnancy.",
        "Public Awareness Campaigns": "The Karnataka government periodically runs public awareness campaigns and programs to educate people about diabetes prevention, early detection, and management. These campaigns include health camps, workshops, and outreach activities.",
        "School Health Programs": "Karnataka includes diabetes awareness and prevention as part of its school health program to educate children about healthy lifestyles and raise awareness about the disease.",
        "Rural Health Services": "The government operates various healthcare centers in rural areas, where diabetes awareness and screening may be conducted."
    },
    "Karnataka Government Healthcare Schemes Up To That Point": {
        "Vajpayee Arogyashree Scheme": "This scheme provides financial protection to below-poverty-line (BPL) families in Karnataka for secondary and tertiary care hospitalization expenses. It covers a wide range of medical treatments, including surgeries and critical illnesses.",
        "Mukhyamantri Arogya Bhagya Scheme": "Similar to the Vajpayee Arogyashree Scheme, this initiative aims to provide cashless medical treatment to BPL families in Karnataka. It offers coverage for a range of health conditions and treatments.",
        "RSBY": "This is a national health insurance program that aims to provide financial protection to families living below the poverty line. Karnataka, like other states, participates in this scheme.",
        "Arogya Sanjeevini Scheme": "Launched under the Ayushman Bharat Pradhan Mantri Jan Arogya Yojana (PM-JAY), this scheme provides healthcare coverage to eligible beneficiaries, offering financial protection for hospitalization expenses.",
        "JSSK": "JSSK is a government program that offers free and cashless maternal and neonatal care services. It covers the expenses related to childbirth and newborn care.",
        "KHFWS": "This department is responsible for various healthcare initiatives and programs aimed at improving public health, including immunization, disease control, and maternal and child health services.",
        "HWCs": "Karnataka, under the National Health Mission (NHM), has been establishing Health and Wellness Centers (HWCs) that offer comprehensive primary healthcare services, including preventive and promotive care.",
        "NTCP": "Karnataka participates in the national effort to control and prevent tuberculosis through this program, which offers diagnosis and treatment services for TB patients.",
        "Mukhyamantri Anila Bhagya Scheme": "This initiative provides free LPG connections to BPL families in Karnataka to promote clean cooking and reduce indoor air pollution-related health issues.",
        "Public Health Campaigns": "The Karnataka government conducts various public health campaigns and awareness programs on topics such as sanitation, hygiene, family planning, and nutrition"
    },
    "India Government Healthcare Schemes Up To That Point" : {
        "PM-JAY": "Also known as the Ayushman Bharat scheme, this is one of the largest government-sponsored healthcare insurance programs globally. It aims to provide financial protection to vulnerable families by offering cashless coverage for hospitalization expenses, including surgeries and treatments.",
        "NHM": "NHM encompasses various programs and initiatives aimed at improving healthcare services, including the National Rural Health Mission (NRHM) and the National Urban Health Mission (NUHM). It focuses on maternal and child health, disease control, and strengthening healthcare infrastructure.",
        "JSY": "JSY is a safe motherhood intervention under NHM that encourages institutional delivery by providing cash assistance to pregnant women.",
        "RBSK": "RBSK focuses on child health and early detection and management of birth defects, diseases, and deficiencies in children.",
        "PMMVY": "This maternity benefit program provides financial assistance to pregnant and lactating women for their first living child. It aims to improve maternal and child health.",
        "NRDWP": "While not exclusively a healthcare program, NRDWP aims to provide safe drinking water, which is crucial for preventing waterborne diseases and improving public health",
        "NTCP": "NTCP focuses on tobacco control measures, including awareness campaigns, cessation support, and enforcing tobacco control laws.",
        "NVBDCP": "This program aims to control vector-borne diseases like malaria, dengue, and lymphatic filariasis through prevention, surveillance, and treatment.",
        "NMHP": "NMHP focuses on promoting mental health, preventing mental illnesses, and providing treatment and rehabilitation services for those with mental health conditions.",
        "NACP": "NACP works to prevent and control the spread of HIV/AIDS in India through awareness, testing, treatment, and support services.",
        "NTBCP": "Focuses on tuberculosis (TB) prevention, diagnosis, and treatment, with an emphasis on reaching vulnerable populations.",
        "NPCBVI": "This program aims to eliminate avoidable blindness and provide eye care services, including cataract surgeries",
        "NPCDCS": "NPCDCS focuses on preventing and managing non-communicable diseases (NCDs) like diabetes, cardiovascular diseases, and cancer.",
        "NOTTO": "NOTTO promotes organ donation and facilitates organ transplantation to save lives",
        "NPPA": "NPPA regulates the prices of essential medicines and medical devices to ensure affordability and accessibility."
    }
}